In [7]:
# import essential libraries
import numpy as np
import pandas as pd

In [9]:
df = pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/hr_data.csv')
df

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [12]:
df = pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/amazon_fires.csv',encoding='ISO-8859-1')
df

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [13]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

# var.head()
- it is use to display first  by row
  # var.head(n)
  - To display first n numbers of rows
# var.tail(n)
  - It diplay last n row
  - It is use to display to bottum row
# df.describe()-
 - it will return the stastical information about dataframe(it will return numeric data)

# df.describe(include=object)
 -  It will return the stastical information including object data as well as
# var.shap()-
- It will return the how many row and column in data set
# var['col_name].unique()-
- It will return the unique value present in the column.
# var['col_name].value_counts()-
- It will count how many times are value repated.s

In [14]:
df.describe()

               ano
count  6454.000000
mean   2007.461729
std       5.746654
min    1998.000000
25%    2002.000000
50%    2007.000000
75%    2012.000000
max    2017.000000

In [16]:
df.describe(include=object)

            mes estado numero  encontro
count      6454   6454   6322      6454
unique       12     23   1728        20
top     Janeiro    Rio      0  1/1/1998
freq        541    717    433       324

In [18]:
df.shape

(6454, 5)

In [20]:
df['mes'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [22]:
df['mes'].value_counts()

mes
Janeiro      541
Fevereiro    540
Março        540
Abril        540
Maio         540
Junho        540
Julho        540
Agosto       540
Setembro     540
Outubro      540
Novembro     540
Dezembro     513
Name: count, dtype: int64